target/test-classes/inputxmls/amendRequestMetValidXml.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:m0="http://wsi.nat.bt.com/2005/06/StandardHeader/" xmlns:m1="http://capabilities.nat.bt.com/xsd/ManageEngineeringTask/2008/06/30/CCM/AmendTaskRequest/Activities" xmlns:m2="http://capabilities.nat.bt.com/xsd/ManageEngineeringTask/2008/06/30/CCM/AmendTaskRequest/Incidents" xmlns:m3="http://capabilities.nat.bt.com/xsd/ManageEngineeringTask/2008/06/30/CCM/AmendTaskRequest/Agreements" xmlns:m4="http://capabilities.nat.bt.com/xsd/ManageEngineeringTask/2008/06/30/CCM/AmendTaskRequest/Portfolio" xmlns:m5="http://capabilities.nat.bt.com/xsd/ManageEngineeringTask/2008/06/30/CCM/AmendTaskRequest/Services" xmlns:m6="http://capabilities.nat.bt.com/xsd/ManageEngineeringTask/2008/06/30/CCM/AmendTaskRequest/CoreClasses/Specifications" xmlns:m7="http://capabilities.nat.bt.com/xsd/ManageEngineeringTask/2008/06/30/CCM/AmendTaskRequest/BaseTypes" xmlns:m8="http://capabilities.nat.bt.com/xsd/ManageEngineeringTask/2008/06/30/CCM/AmendTaskRequest/HR" xmlns:m9="http://capabilities.nat.bt.com/xsd/ManageEngineeringTask/2008/06/30/CCM/AmendTaskRequest/Scheduling" xmlns:m10="http://capabilities.nat.bt.com/xsd/ManageEngineeringTask/2008/06/30/CCM/AmendTaskRequest/Parties" xmlns:m11="http://capabilities.nat.bt.com/xsd/ManageEngineeringTask/2008/06/30/CCM/AmendTaskRequest/Places" xmlns:m12="http://capabilities.nat.bt.com/xsd/ManageEngineeringTask/2008/06/30/CCM/AmendTaskRequest/MTOSI" xmlns:m13="http://capabilities.nat.bt.com/xsd/ManageEngineeringTask/2008/06/30/CCM/AmendTaskRequest/MTOSI/Structs" xmlns:m14="http://capabilities.nat.bt.com/xsd/ManageEngineeringTask/2008/06/30/CCM/AmendTaskRequest/MTOSI/Enums" xmlns:m15="http://capabilities.nat.bt.com/xsd/ManageEngineeringTask/2008/06/30/CCM/AmendTaskRequest/OperationalAnalysis" xmlns:m16="http://capabilities.nat.bt.com/xsd/ManageEngineeringTask/2008/06/30/CCM/AmendTaskRequest/Interaction" xmlns:m17="http://capabilities.nat.bt.com/xsd/ManageEngineeringTask/2008/06/30/CCM/AmendTaskRequest/Users" xmlns:m18="http://capabilities.nat.bt.com/xsd/ManageEngineeringTask/2008/06/30/CCM/AmendTaskRequest/Parties/PartyRoles/Customer">
	<SOAP-ENV:Body>
		<m:amendTaskRequest xmlns:m="http://capabilities.nat.bt.com/xsd/ManageEngineeringTask/2008/06/30"   xsi:schemaLocation="http://capabilities.nat.bt.com/xsd/ManageEngineeringTask/2008/06/30 ManageEngineeringTask.20080630.xsd" >
			<m0:standardHeader>
				<m0:e2e>
					<m0:E2EDATA>E2E.busTxnHdr=PCK0020691</m0:E2EDATA>
				</m0:e2e>
				<m0:serviceState>
					<m0:stateCode>OK</m0:stateCode>
				</m0:serviceState>
				<m0:serviceAddressing>
					<m0:from>http://ccm.intra.bt.com/EWOCS</m0:from>
					<m0:to>
						<m0:address>http://ccm.intra.bt.com/METsk</m0:address>
					</m0:to>
					<m0:replyTo>
						<m0:address>http://ccm.intra.bt.com/EWOCS</m0:address>
						<m0:contextItemList>
							<m0:contextItem contextId="http://ccm.intra.bt.com/EWOCS" contextName="serviceType">EWOCS</m0:contextItem>
							<m0:contextItem contextId="http://ccm.intra.bt.com/EWOCS" contextName="instanceId">EO</m0:contextItem>
							<m0:contextItem contextId="http://ccm.intra.bt.com/EWOCS" contextName="taskIdentifier">307122</m0:contextItem>
						</m0:contextItemList>
					</m0:replyTo>
					<m0:messageId>43262274</m0:messageId>
					<m0:serviceName>http://capabilities.nat.bt.com/ManageEngineeringTask</m0:serviceName>
					<m0:action>http://capabilities.intra.bt.com/ManageEngineeringTask#AmendTaskRequest</m0:action>
				</m0:serviceAddressing>
				<m0:serviceSpecification>
					<m0:payloadFormat>XML</m0:payloadFormat>
					<m0:version>1.0</m0:version>
					<m0:revision>0</m0:revision>
				</m0:serviceSpecification>
			</m0:standardHeader>
			<m:task>
				<m1:amendmentReason>Pintask Request for pin ESSON01</m1:amendmentReason>
				<m1:telephoneNumber>307122</m1:telephoneNumber>
				<m1:expectedFinishDateTime>10/07/2019 07:00:00</m1:expectedFinishDateTime>
				<m1:secondaryCommitmentLatestFinish>10/07/2019 23:59:00</m1:secondaryCommitmentLatestFinish>
				<m1:responseIndicator>NONE</m1:responseIndicator>
				<m1:workLocationQualifier>C</m1:workLocationQualifier>
				<m1:importantClass>18</m1:importantClass>
				<m1:jIN>
					<m1:name>TASKIDENTIFIER</m1:name>
					<m1:value>GRND2E001</m1:value>
				</m1:jIN>
				<m1:associateTask>
					<m1:name>TIMESHEETREFERENCENUMBER</m1:name>
					<m1:value>LFSC/GRND2E</m1:value>
				</m1:associateTask>
				<m1:associateTask>
					<m1:name>DUMMYTASKID</m1:name>
					<m1:value>GRND2E001</m1:value>
				</m1:associateTask>
				<m1:taskCategory>
					<m1:name>FULFILMENT</m1:name>
				</m1:taskCategory>
				<m1:problem>
					<m2:problemReportCode>NDT</m2:problemReportCode>
					<m2:mainproblemLocation>LN</m2:mainproblemLocation>
					<m2:problemCategory>
						<m2:productType>COMPLEX</m2:productType>
					</m2:problemCategory>
					<m2:fault>
						<m2:dateTimeRaised>10/07/2019 08:50:22</m2:dateTimeRaised>
					</m2:fault>
				</m1:problem>
				<m1:careLevel>
					<m3:name>STANDARD CARE</m3:name>
				</m1:careLevel>
				<m1:taskNote>
					<m1:name>HAZARD</m1:name>
					<m1:value>
						<![CDATA[No Data Available Via Ewocs]]>
					</m1:value>
				</m1:taskNote>
				<m1:taskNote>
					<m1:name>WARNING</m1:name>
					<m1:value>
						<![CDATA[No Data Available Via Ewocs]]>
					</m1:value>
				</m1:taskNote>
				<m1:taskNote>
					<m1:name>LINETEST</m1:name>
					<m1:value>
						<![CDATA[No Data Available Via Ewocs]]>
					</m1:value>
				</m1:taskNote>
				<m1:taskNote>
					<m1:name>TECHNICAL</m1:name>
					<m1:value>
						<![CDATA[dfgfhghj]]>
					</m1:value>
				</m1:taskNote>
				<m1:taskNote>
					<m1:name>ACCESS</m1:name>
					<m1:value>
						<![CDATA[No Access Notes Available]]>
					</m1:value>
				</m1:taskNote>
				<m1:taskNote>
					<m1:name>GENERAL</m1:name>
					<m1:value>
						<![CDATA[CASE NOTES  Task Created by eWocs test 10-JUL-2019 *** Case Fluidity Reason Changed *** test test Task Created by eWocs 10-JUL-2019 *** Future Pin request on 10/07/2019 entered by Vijay Tejam 611070898 @10/07/2019 08:45 *** Appt added for 10/07/2019 PM Pinned to ESSON01 in AWI Appointment created via EW through Webservices This appointment will remove any previously entered make fluid activities.Above Appointment entered by Vijay Tejam 10/07/2019 08:45 10-JUL-2019 Task Created by eWocs 10-JUL-2019 Pin task event triggered. Above scheduled event entered by Vijay Tejam 611070898 10-JUL-19 08:50 Appointment  "10/07/2019 PM|~:Y|~:991611070898" deleted with notes. Appointment deleted via EW through Webservices ]]>
					</m1:value>
				</m1:taskNote>
				<m1:taskNote>
					<m1:name> PRIORITY</m1:name>
					<m1:value>
						<![CDATA[]]>
					</m1:value>
				</m1:taskNote>
				<m1:taskNote>
					<m1:name>TASK</m1:name>
					<m1:value>
						<![CDATA[************** AUTO BUILT EWOCS Primary Task ************** ****** Reminder: Only Complete Fully completed tasks  ****** Contact Name: FIRSTNAME  SURNAME CONTACT: 01908 6248644 ADDRESS IS  ORDER DESCRIPTION FIB REAC BLD (PRIM) CASE TASKS 1#NI7F#Prov/Rec Blown Fib  Cabling U/G per 100m ClAIMED TASKS 0#NI7F# (0:00) Remaining WAU's 1#NI7F # (0:24) ************************************************************CASE NOTES  Task Created by eWocs test 10-JUL-2019 *** Case Fluidity Reason Changed *** test test Task Created by eWocs 10-JUL-2019 *** Future Pin request on 10/07/2019 entered by Vijay Tejam 611070898 @10/07/2019 08:45 *** Appt added for 10/07/2019 PM Pinned to ESSON01 in AWI Appointment created via EW through Webservices This appointment will remove any previously entered make fluid activities.Above Appointment entered by Vijay Tejam 10/07/2019 08:45 10-JUL-2019 Task Created by eWocs 10-JUL-2019 Pin task event triggered. Above scheduled event entered by Vijay Tejam 611070898 10-JUL-19 08:50 Appointment  "10/07/2019 PM|~:Y|~:991611070898" deleted with notes. Appointment deleted via EW through Webservices ]]>
					</m1:value>
				</m1:taskNote>
				<m1:order>
					<m3:toReference>WAGRND2E</m3:toReference>
					<m3:orderItem>
						<m3:note>
							<m3:noteType>PRODUCTDESCRIPTION</m3:noteType>
							<m3:text>Prov/Rec Blown Fib  Cabling U/G per 100m</m3:text>
						</m3:note>
						<m3:productInstance>
							<m4:productName>
								<m6:name>NAMES</m6:name>
								<m6:identifier>
									<m6:name>NI7F</m6:name>
								</m6:identifier>
							</m4:productName>
						</m3:productInstance>
						<m3:quantity>
							<m7:units>UNITS</m7:units>
							<m7:amount>+1</m7:amount>
						</m3:quantity>
						<m3:wauProductInstance>
							<m4:wauProductType>
								<m4:name>BTWAUProductType</m4:name>
								<m4:value>
									<![CDATA[S]]>
								</m4:value>
							</m4:wauProductType>
							<m4:note>
								<m4:noteType>BTWAUProductLongDescription</m4:noteType>
								<m4:text>
									<![CDATA[All activities necessary to blow a fibre cable into or out of an existing or pre-installed sub-duct including but not limited to:  Setting up blowing equipment; Preparing sub duct and cable ends (links swivels, grips); Fleeting cable; Blow in cable; Jointing sub duct; Cap end; providing certified records.]]>
								</m4:text>
							</m4:note>
							<m4:note>
								<m4:noteType>BTWAUUsage</m4:noteType>
								<m4:text>
									<![CDATA[Blowing of COF or miniCOF into a subduct or mini subduct. Total lengths installed centre to centre on job rounded to next 100M. Allow set ups for blowing points.]]>
								</m4:text>
							</m4:note>
							<m4:wauUnitOfIssue>
								<m4:name>BTUnitOfIssue</m4:name>
								<m4:value>
									<![CDATA[Per 100M]]>
								</m4:value>
							</m4:wauUnitOfIssue>
							<m4:wauSingleUnitTime>
								<m4:name>BTSingleUnitTime</m4:name>
								<m4:value>.4</m4:value>
							</m4:wauSingleUnitTime>
							<m4:wauEngineeringActivity>
								<m4:name>BTEngineeringActivity</m4:name>
								<m4:value>Fibre Blowing</m4:value>
							</m4:wauEngineeringActivity>
						</m3:wauProductInstance>
					</m3:orderItem>
					<m3:orderIdentifier>
						<m3:name>ProjectId</m3:name>
						<m3:value>A526N</m3:value>
					</m3:orderIdentifier>
				</m1:order>
				<m1:taskRole>
					<m1:name>LOB</m1:name>
					<m1:value>Openreach</m1:value>
				</m1:taskRole>
				<m1:employeeIdentifier>
					<m8:name>ENGINEERPIN</m8:name>
					<m8:value>ESSON01</m8:value>
				</m1:employeeIdentifier>
				<m1:managedElement>
					<m12:aliasNameList>
						<m13:attributeName>CODE1141</m13:attributeName>
						<m13:attributeValue>L/NZ</m13:attributeValue>
					</m12:aliasNameList>
					<m12:equipmentHolder>
						<m12:location>
							<m11:accessFor24hr>true</m11:accessFor24hr>
						</m12:location>
					</m12:equipmentHolder>
				</m1:managedElement>
				<m1:siteContact>
					<m18:customerSite>
						<m18:customerContact>
							<m18:contactDetails>
								<m10:person>
									<m10:personName>
										<m10:forename>Claire</m10:forename>
										<m10:surname>Bennet</m10:surname>
									</m10:personName>
								</m10:person>
								<m10:phoneNumber>
									<m10:phoneNumber>+919881744526</m10:phoneNumber>
								</m10:phoneNumber>
								<m10:address>
									<m11:welshPostalAddress>
										<m11:uKPostalAddress>
											<m11:thoroughfareNumber/>
											<m11:thoroughfareName/>
											<m11:dependentThoroughfareName/>
											<m11:dependentLocality/>
											<m11:subPremise/>
											<m11:organization/>
											<m11:postTown/>
											<m11:buildingName/>
											<m11:county/>
											<m11:poBox/>
											<m11:postCode>EN9 2LP</m11:postCode>
										</m11:uKPostalAddress>
									</m11:welshPostalAddress>
									<m11:country>
										<m11:name>String</m11:name>
									</m11:country>
								</m10:address>
							</m18:contactDetails>
						</m18:customerContact>
					</m18:customerSite>
				</m1:siteContact>
				<m1:productInstance>
					<m4:productSpecification>
						<m4:serviceSpecification>
							<m5:id>307122</m5:id>
						</m4:serviceSpecification>
					</m4:productSpecification>
				</m1:productInstance>
				<m1:serviceInstance>
					<m5:definitelyAffectedFlag>true</m5:definitelyAffectedFlag>
				</m1:serviceInstance>
				<m1:taskCharacteristic>
					<m1:name>BTJOBPACKURL</m1:name>
					<m1:value>
						<![CDATA[http://10.54.209.97:80/ORjobpackretrievalweb/default.aspx?id=1263904]]>
					</m1:value>
				</m1:taskCharacteristic>
				<m1:taskCharacteristic>
					<m1:name>JOBTYPEID</m1:name>
					<m1:value/>
				</m1:taskCharacteristic>
				<m1:taskCharacteristic>
					<m1:name>PROPOSEDIND</m1:name>
					<m1:value>P</m1:value>
				</m1:taskCharacteristic>
				<m1:taskCharacteristic>
					<m1:name>GANGDETAILS</m1:name>
					<m1:value>
						<![CDATA[000000000+000000000+0000000+true]]>
					</m1:value>
				</m1:taskCharacteristic>
				<m1:taskCharacteristic>
					<m1:name>UPSTREAMDATABANDWIDTH</m1:name>
					<m1:value/>
				</m1:taskCharacteristic>
				<m1:taskCharacteristic>
					<m1:name>DOWNSTREAMDATABANDWIDTH</m1:name>
					<m1:value/>
				</m1:taskCharacteristic>
				<m1:taskCharacteristic>
					<m1:name>UPDATETASKSTATUSREQUEST</m1:name>
					<m1:value>True</m1:value>
				</m1:taskCharacteristic>
				<m1:taskCharacteristic>
					<m1:name>UPDATESTATUSTO</m1:name>
					<m1:value>ALLOCATED</m1:value>
				</m1:taskCharacteristic>
				<m1:taskCharacteristic>
					<m1:name>VisualiserDataAvailable</m1:name>
					<m1:value>N</m1:value>
				</m1:taskCharacteristic>
				<m1:taskInstallation>
					<m1:id>-011</m1:id>
				</m1:taskInstallation>
				<m1:taskSpecification>
					<m1:skillSpecification>
						<m8:id>ACFC</m8:id>
						<m8:type>PRIMARY</m8:type>
						<m8:skillDuration>00024</m8:skillDuration>
						<m8:numberOfPeople>1</m8:numberOfPeople>
					</m1:skillSpecification>
				</m1:taskSpecification>
				<m1:taskCharge/>
				<m1:resourceRequirements>
					<m1:minResourceNumber>2</m1:minResourceNumber>
					<m1:maxResourceNumber>4</m1:maxResourceNumber>
					<m1:optimumResourceNumber>3</m1:optimumResourceNumber>
					<m1:resourceType>ENGINEER</m1:resourceType>
				</m1:resourceRequirements>
			</m:task>
		</m:amendTaskRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>